![title](img/cover4.png)

<center><em>Copyright! This material is protected, please do not copy or distribute.    by:Taher Assaf</em></center>

***
<h1 align="center">Udemy course : Python Bootcamp for Data Science 2021 Numpy Pandas & Seaborn</h1> 

***

## 10.1 Hierarchical Indexing

First we import numpy and pandas libraries:

In [1]:
import numpy as np
import pandas as pd

Here we create a series with multi-index:

In [2]:
ser1 = pd.Series(np.random.randn(9),
                 index=[['2010','2010','2010','2011','2011','2011','2012','2012','2012'],
                        ['one', 'two','three', 'one', 'two','three','one', 'two','three'] ])
ser1

2010  one     -2.507580
      two     -0.167991
      three    0.005880
2011  one     -0.452818
      two      0.246235
      three   -2.028408
2012  one      1.307811
      two     -0.299587
      three    0.381642
dtype: float64

To display the index of this series, we use the attribute **index**:

In [3]:
ser1.index

MultiIndex([('2010',   'one'),
            ('2010',   'two'),
            ('2010', 'three'),
            ('2011',   'one'),
            ('2011',   'two'),
            ('2011', 'three'),
            ('2012',   'one'),
            ('2012',   'two'),
            ('2012', 'three')],
           )

We can select all data that belong to 2010, like this:

In [4]:
ser1['2010']

one     -2.507580
two     -0.167991
three    0.005880
dtype: float64

We can also select data that belong to a range of index values:

In [5]:
ser1['2011':'2012']

2011  one     -0.452818
      two      0.246235
      three   -2.028408
2012  one      1.307811
      two     -0.299587
      three    0.381642
dtype: float64

We can also select data that belong to multiple index values:

In [6]:
ser1.loc[['2010','2012']]

2010  one     -2.507580
      two     -0.167991
      three    0.005880
2012  one      1.307811
      two     -0.299587
      three    0.381642
dtype: float64

We can also select data based on the second level of index:

In [7]:
ser1.loc[:,'one']

2010   -2.507580
2011   -0.452818
2012    1.307811
dtype: float64

We can convert a multi-index series to a dataframe using the function **unstack()**:

In [8]:
data1 = ser1.unstack()
data1

           one     three       two
2010 -2.507580  0.005880 -0.167991
2011 -0.452818 -2.028408  0.246235
2012  1.307811  0.381642 -0.299587

We can also convert a dataframe into a multi-index series, using the function **stack()**:

In [9]:
data1.stack()

2010  one     -2.507580
      three    0.005880
      two     -0.167991
2011  one     -0.452818
      three   -2.028408
      two      0.246235
2012  one      1.307811
      three    0.381642
      two     -0.299587
dtype: float64

For dataframes, lets now read this dataframe from a csv file using the function **pd.read_csv()**:

In [10]:
data = pd.read_csv('data/ex5.csv')
data

    year quarters  sale1  sale2  sale3
0   2010        A    200    258    592
1   2010        B    328    664    606
2   2010        C    870    249    918
3   2010        D    209    971    629
4   2011        A    348    863    929
5   2011        B    475    999    610
6   2011        C    944    356    540
7   2011        D    190     12    673
8   2012        A    129    936     14
9   2012        B     31    877    181
10  2012        C    646    768    862
11  2012        D    284    792    688

We can create a multi-index for a dataframe using the function **set_index()** with two columns, here we used 'year' and 'quarters':

In [11]:
multi_data = data.set_index(['year', 'quarters'])
multi_data

               sale1  sale2  sale3
year quarters
2010 A           200    258    592
     B           328    664    606
     C           870    249    918
     D           209    971    629
2011 A           348    863    929
     B           475    999    610
     C           944    356    540
     D           190     12    673
2012 A           129    936     14
     B            31    877    181
     C           646    768    862
     D           284    792    688

We can display the multi-index using the attribute **index**:

In [12]:
multi_data.index

MultiIndex([(2010, 'A'),
            (2010, 'B'),
            (2010, 'C'),
            (2010, 'D'),
            (2011, 'A'),
            (2011, 'B'),
            (2011, 'C'),
            (2011, 'D'),
            (2012, 'A'),
            (2012, 'B'),
            (2012, 'C'),
            (2012, 'D')],
           names=['year', 'quarters'])

In dataframes, we can select data based on index levels using the function **loc[ ]**:

In [13]:
multi_data.loc[2010]

          sale1  sale2  sale3
quarters
A           200    258    592
B           328    664    606
C           870    249    918
D           209    971    629

We can also select data based on the two index levels:

In [14]:
multi_data.loc[(2010,'A')]

sale1    200
sale2    258
sale3    592
Name: (2010, A), dtype: int64

Multi-index can also be applied for **columns**. And you can do that by passing two lists for the columns’ argument:

In [15]:
data = pd.DataFrame(np.random.randint(100, size = (4,4)),
                    columns = [['green', 'green', 'black','black'], ['one', 'two','one','two']])
data

  green     black
    one two   one two
0    27  56    41  83
1     6  89     0  53
2    69  99    27  92
3    72  35    21  42

***

<h1 align="center">Thank You</h1> 

***